* BaseConfig
Copilot, Magit, All-the-icons, Doom themes, Treemacs, Superstar mode, Markdown mode, Recentf, Spell checking
#+begin_src elisp
  ;; Package instalation
  ;; Copilot
  (use-package copilot
    :straight (:host github :repo "copilot-emacs/copilot.el" :files ("*.el"))
    :ensure t
    :hook (prog-mode . copilot-mode)
    :config
    (define-key copilot-completion-map (kbd "C-<tab>") 'copilot-accept-completion)
    (define-key copilot-completion-map (kbd "C-~") 'copilot-accept-completion-by-word))
  ;; Disable indent warning
  (setq copilot-disable-prompt-on-indent t)
  (setq copilot-indent-offset-warning-disable 1)
  ;; Magit
  (use-package magit)

  ;; All-the-icons
  (use-package all-the-icons)

  ;; Doom themes
  (use-package doom-themes)
  (load-theme 'doom-one t)

  ;; ;; Treemacs
  (use-package treemacs)

  ;; ;; Treemacs icons
  (use-package treemacs-all-the-icons)
  (treemacs-load-theme "all-the-icons")

  ;; Superstar mode
  (use-package org-superstar
    :straight (:host github :repo "integral-dw/org-superstar-mode")
    :ensure t
    :config
    (org-superstar-configure-like-org-bullets)
    (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))
    (setq superstar-cycle-sequence '("◉" "◎" "○" "●")))

  ;; Markdown mode
  (use-package markdown-mode
    :ensure t
    :mode (("\\.md\\'" . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :hook (markdown-mode . prettify-symbols-mode)
    :custom
    (prettify-symbols-alist
     '(("#" . "•")    ; Level 1 heading
       ("##" . "▪")   ; Level 2
       ("###" . "▫")  ; Level 3
       ("####" . "⁃") ; Level 4
       ("*" . "•")    ; Bullet list
       ("+" . "◦")    ; Alternative
       ("-" . "–")
       ("=>". "⇒")
       ("<=" . "⇐")
       ("lambda" . "λ")
       ("->" . "→"))))

  ;; Enable src block execution in markdown
  (use-package md-babel
    :straight (:host github :repo "md-babel/md-babel.el")
    :ensure t
    :after markdown-mode
    :config
    (define-key markdown-mode-command-map (kbd "C-c") #'md-babel-execute-block-at-point)) 

  ;; Recentf
  (use-package recentf)
  (recentf-mode 1)
  (setq recentf-max-saved-items 20)


  ;; Enable spell checking in org-mode
  (add-hook 'org-mode-hook 'flyspell-mode)

  (use-package centered-window
    :config
    (centered-window-mode t))

#+end_src

#+RESULTS:
: t

* Minibuffer
#+begin_src elisp
  ;; Consult/Vertico and styling setup
  ;; Minibuffer completion framework
  ;; Vertico for vertical completion
  ;; Consult for enhanced commands
  ;; Orderless for flexible matching
  ;; Marginalia for annotations

  (use-package vertico
    :ensure t
    :config
    (vertico-mode 1))

  (use-package vertico-posframe
    :ensure t
    :config
    (vertico-posframe-mode 1)
    (setq vertico-posframe-parameters
          '((left-fringe . 8)
            (right-fringe . 8)
            (border-width . 2))))

  (use-package consult
    :ensure t
    :bind (("C-x C-m" . consult-buffer)
           ("C-s" . consult-line)
           ("C-x C-f" . consult-find)))

  (use-package orderless
    :ensure t
    :config
    (setq completion-styles '(orderless)))
  (setq vertico-posframe-poshandler #'posframe-poshandler-frame-center)
  (setq vertico-posframe-border-width 1)

  (use-package marginalia
    :ensure t
    :config
    (marginalia-mode))
  #+end_src
* General Settings
#+begin_src elisp
     (defun my/complete-from-list (items &optional prompt initial)
       (interactive)
       (let ((prompt (or prompt "Select item: ")))
         (minibuffer-with-setup-hook
             (lambda ()
               (add-hook 'minibuffer-exit-hook
                         (lambda () (kill-buffer "*Preview*"))
                         nil t))
           (completing-read
            prompt
            items
            nil
            t
            initial
            'my/complete-from-list-history
            nil
            (lambda (cand)
              (with-current-buffer (get-buffer-create "*Preview*")
                (erase-buffer)
                (if (file-exists-p cand)
                    (insert-file-contents cand nil 0 1000)
                  (insert (format "Preview: %s" cand)))))))))
      
     ;; Define variables here
     ;; -------------------------------------------------- ;;
     ;; Display line numbers
     (setq display-line-numbers-type `relative)
     (setq display-line-numbers-mode t)
     (global-display-line-numbers-mode)

     ;; Set Font to MonaspaceNeonNF-Regular
     (set-face-attribute 'default nil :height 180 :weight 'normal :family "MonaspaceNeonNF-Regular")
     ;; hide tool-bar and menu-bar
     (tool-bar-mode -1)
     (menu-bar-mode -1)

  ;; scratch as initial buffer
  (setq initial-buffer-choice t)

  ;; Set def directory
  (setq default-directory "~/")

  ;; Enable shift selection in org-mode
  (setq org-support-shift-select t)

  ;; Set python interpreter for org-babel
  (setq org-babel-python-command "uv run python")

  ;; Enable src block execution whithout confirmation
   (setq org-confirm-babel-evaluate nil)

   ;; Disable sound
   (setq ring-bell-function 'ignore)

#+end_src

#+RESULTS:
: ignore

* LSP Python

#+begin_src elisp
  ;; ------------------------------------------------------------
  ;; 1. LSP Mode for Intelligence (pyright)
  ;; ------------------------------------------------------------
  (use-package lsp-mode
    :commands lsp lsp-deferred
    :hook (python-mode . lsp-deferred) ; Start pyright automatically for Python
    :hook (rustic-mode . lsp-deferred) ; Start rust-analyzer automatically for Rust
    :config
    (setq lsp-diagnostics-provider :flymake)
    ;; Optional: Reduce noise
    (setq lsp-auto-guess-root nil)
    (setq lsp-log-io nil)
    (setq lsp-rust-server 'rust-analyzer)
    (setq lsp-rust-analyzer-server-command '("rustup" "run" "stable" "rust-analyzer"))
    (setq lsp-enable-snippet nil)

    )

  ;; Use pyright as the LSP server for Python
  (use-package lsp-pyright
    :ensure t
    :hook (python-mode . (lambda ()
                            (require 'lsp-pyright)
                            ;; Optional: Disable pyright's formatting if you want ruff to handle it
                            (setq-local lsp-pyright-disable-diagnostics t) ; Let ruff handle diagnostics
                            (setq-local lsp-pyright-disable-organize-imports t) ; Let ruff handle imports
                            ))
    :config
    ;; Use ruff for diagnostics instead of pyright
    (lsp-register-custom-settings
     '(("pyright.disableDiagnostics" t t)))
    )

  ;; ------------------------------------------------------------
  ;; 2. Company for Autocompletion (provided by pyright)
  ;; ------------------------------------------------------------
  (use-package company
    :ensure t
    :hook (lsp-mode . company-mode)
    :config
    (setq company-minimum-prefix-length 1)
    (setq company-tooltip-align-annotations t)
    )

  (use-package pyvenv)

#+end_src

#+RESULTS:

* RustLSP
#+begin_src elisp
  ;; Rustic Mode (enhanced Rust editing)
  (use-package rustic
    :ensure t
    :bind (:map rustic-mode-map
                ("M-j" . lsp-ui-imenu)  ; Jump to symbols
                ("M-?" . lsp-find-references)  ; Find references
                ("C-c C-c l" . flycheck-list-errors)  ; List errors
                ("C-c C-c a" . lsp-execute-code-action)  ; Code actions
                ("C-c C-c r" . lsp-rename)  ; Rename symbol
                ("C-c C-c q" . lsp-workspace-restart)  ; Restart LSP
                ("C-c C-c Q" . lsp-workspace-shutdown)  ; Shutdown LSP
                ("C-c C-c s" . lsp-rust-analyzer-status))  ; Check server status
    :config
    ;; Optional: Reduce flashiness
    ;; (setq lsp-eldoc-hook nil)
    ;; (setq lsp-enable-symbol-highlighting nil)
    ;; (setq lsp-signature-auto-activate nil)

    ;; Format on save (uncomment to disable: (setq rustic-format-on-save nil))
    (setq rustic-format-on-save t))
#+end_src
* Ino

#+begin_src elisp
(use-package arduino-cli-mode
  :ensure t
  :hook arduino-mode
  :mode "\\.ino\\'"
  :custom
  (arduino-cli-warnings 'all)
  (arduino-cli-verify t))
#+end_src

#+RESULTS:
: ((\.ino\' . arduino-cli-mode) (\.rs\' . rustic-mode) (\.rs\' . rust-mode) (\.markdown\' . markdown-mode) (\.md\' . markdown-mode) (\.\(?:md\|markdown\|mkd\|mdown\|mkdn\|mdwn\)\' . markdown-mode) (/git-rebase-todo\' . git-rebase-mode) (\.ou?tl\' . outline-mode) (\.kotl?\' . kotl-mode) (\.gpg\(~\|\.~[0-9]+~\)?\' nil epa-file) (\.elc\' . elisp-byte-code-mode) (\.zst\' nil jka-compr) (\.dz\' nil jka-compr) (\.xz\' nil jka-compr) (\.lzma\' nil jka-compr) (\.lz\' nil jka-compr) (\.g?z\' nil jka-compr) (\.bz2\' nil jka-compr) (\.Z\' nil jka-compr) (\.vr[hi]?\' . vera-mode) (\(?:\.\(?:rbw?\|ru\|rake\|thor\|axlsx\|jbuilder\|rabl\|gemspec\|podspec\)\|/\(?:Gem\|Rake\|Cap\|Thor\|Puppet\|Berks\|Brew\|Fast\|Vagrant\|Guard\|Pod\)file\)\' . ruby-mode) (\.re?st\' . rst-mode) (/\(?:Pipfile\|\.?flake8\)\' . conf-mode) (\.py[iw]?\' . python-mode) (\.m\' . octave-maybe-mode) (\.less\' . less-css-mode) (\.editorconfig\' . editorconfig-conf-mode) (\.scss\' . scss-mode) (\.cs\' . csharp-mode) (\.awk\' . awk-mode) (\.\(u?lpc\|pike\|pmod\(\.in\)?\)\' . pike-mode) (\.idl\' . idl-mode) (\.java\' . java-mode) (\.m\' . objc-mode) (\.ii\' . c++-mode) (\.i\' . c-mode) (\.lex\' . c-mode) (\.y\(acc\)?\' . c-mode) (\.h\' . c-or-c++-mode) (\.c\' . c-mode) (\.\(CC?\|HH?\)\' . c++-mode) (\.[ch]\(pp\|xx\|\+\+\)\' . c++-mode) (\.\(cc\|hh\)\' . c++-mode) (\.\(bat\|cmd\)\' . bat-mode) (\.[sx]?html?\(\.[a-zA-Z_]+\)?\' . mhtml-mode) (\.svgz?\' . image-mode) (\.svgz?\' . xml-mode) (\.x[bp]m\' . image-mode) (\.x[bp]m\' . c-mode) (\.p[bpgn]m\' . image-mode) (\.tiff?\' . image-mode) (\.gif\' . image-mode) (\.png\' . image-mode) (\.jpe?g\' . image-mode) (\.webp\' . image-mode) (\.te?xt\' . text-mode) (\.[tT]e[xX]\' . tex-mode) (\.ins\' . tex-mode) (\.ltx\' . latex-mode) (\.dtx\' . doctex-mode) (\.org\' . org-mode) (\.dir-locals\(?:-2\)?\.el\' . lisp-data-mode) (\.eld\' . lisp-data-mode) (eww-bookmarks\' . lisp-data-mode) (tramp\' . lisp-data-mode) (/archive-contents\' . lisp-data-mode) (places\' . lisp-data-mode) (\.emacs-places\' . lisp-data-mode) (\.el\' . emacs-lisp-mode) (Project\.ede\' . emacs-lisp-mode) (\(?:\.\(?:scm\|sls\|sld\|stk\|ss\|sch\)\|/\.guile\)\' . scheme-mode) (\.l\' . lisp-mode) (\.li?sp\' . lisp-mode) (\.[fF]\' . fortran-mode) (\.for\' . fortran-mode) (\.p\' . pascal-mode) (\.pas\' . pascal-mode) (\.\(dpr\|DPR\)\' . delphi-mode) (\.\([pP]\([Llm]\|erl\|od\)\|al\)\' . perl-mode) (Imakefile\' . makefile-imake-mode) (Makeppfile\(?:\.mk\)?\' . makefile-makepp-mode) (\.makepp\' . makefile-makepp-mode) (\.mk\' . makefile-gmake-mode) (\.make\' . makefile-gmake-mode) ([Mm]akefile\' . makefile-gmake-mode) (\.am\' . makefile-automake-mode) (\.texinfo\' . texinfo-mode) (\.te?xi\' . texinfo-mode) (\.[sS]\' . asm-mode) (\.asm\' . asm-mode) (\.css\' . css-mode) (\.mixal\' . mixal-mode) (\.gcov\' . compilation-mode) (/\.[a-z0-9-]*gdbinit . gdb-script-mode) (-gdb\.gdb . gdb-script-mode) ([cC]hange\.?[lL]og?\' . change-log-mode) ([cC]hange[lL]og[-.][0-9]+\' . change-log-mode) (\$CHANGE_LOG\$\.TXT . change-log-mode) (\.scm\.[0-9]*\' . scheme-mode) (\.[ckz]?sh\'\|\.shar\'\|/\.z?profile\' . sh-mode) (\.bash\' . sh-mode) (/PKGBUILD\' . sh-mode) (\(/\|\`\)\.\(bash_\(profile\|history\|log\(in\|out\)\)\|z?log\(in\|out\)\)\' . sh-mode) (\(/\|\`\)\.\(shrc\|zshrc\|m?kshrc\|bashrc\|t?cshrc\|esrc\)\' . sh-mode) (\(/\|\`\)\.\([kz]shenv\|xinitrc\|startxrc\|xsession\)\' . sh-mode) (\.m?spec\' . sh-mode) (\.m[mes]\' . nroff-mode) (\.man\' . nroff-mode) (\.sty\' . latex-mode) (\.cl[so]\' . latex-mode) (\.bbl\' . latex-mode) (\.bib\' . bibtex-mode) (\.bst\' . bibtex-style-mode) (\.sql\' . sql-mode) (\(acinclude\|aclocal\|acsite\)\.m4\' . autoconf-mode) (\.m[4c]\' . m4-mode) (\.mf\' . metafont-mode) (\.mp\' . metapost-mode) (\.vhdl?\' . vhdl-mode) (\.article\' . text-mode) (\.letter\' . text-mode) (\.i?tcl\' . tcl-mode) (\.exp\' . tcl-mode) (\.itk\' . tcl-mode) (\.icn\' . icon-mode) (\.sim\' . simula-mode) (\.mss\' . scribe-mode) (\.f9[05]\' . f90-mode) (\.f0[38]\' . f90-mode) (\.indent\.pro\' . fundamental-mode) (\.\(pro\|PRO\)\' . idlwave-mode) (\.srt\' . srecode-template-mode) (\.prolog\' . prolog-mode) (\.tar\' . tar-mode) (\.\(arc\|zip\|lzh\|lha\|zoo\|[jew]ar\|xpi\|rar\|cbr\|7z\|squashfs\|ARC\|ZIP\|LZH\|LHA\|ZOO\|[JEW]AR\|XPI\|RAR\|CBR\|7Z\|SQUASHFS\)\' . archive-mode) (\.oxt\' . archive-mode) (\.\(deb\|[oi]pk\)\' . archive-mode) (\`/tmp/Re . text-mode) (/Message[0-9]*\' . text-mode) (\`/tmp/fol/ . text-mode) (\.oak\' . scheme-mode) (\.sgml?\' . sgml-mode) (\.x[ms]l\' . xml-mode) (\.dbk\' . xml-mode) (\.dtd\' . sgml-mode) (\.ds\(ss\)?l\' . dsssl-mode) (\.js[mx]?\' . javascript-mode) (\.har\' . javascript-mode) (\.json\' . js-json-mode) (\.[ds]?va?h?\' . verilog-mode) (\.by\' . bovine-grammar-mode) (\.wy\' . wisent-grammar-mode) (\.erts\' . erts-mode) ([:/\]\..*\(emacs\|gnus\|viper\)\' . emacs-lisp-mode) (\`\..*emacs\' . emacs-lisp-mode) ([:/]_emacs\' . emacs-lisp-mode) (/crontab\.X*[0-9]+\' . shell-script-mode) (\.ml\' . lisp-mode) (\.ld[si]?\' . ld-script-mode) (ld\.?script\' . ld-script-mode) (\.xs\' . c-mode) (\.x[abdsru]?[cnw]?\' . ld-script-mode) (\.zone\' . dns-mode) (\.soa\' . dns-mode) (\.asd\' . lisp-mode) (\.\(asn\|mib\|smi\)\' . snmp-mode) (\.\(as\|mi\|sm\)2\' . snmpv2-mode) (\.\(diffs?\|patch\|rej\)\' . diff-mode) (\.\(dif\|pat\)\' . diff-mode) (\.[eE]?[pP][sS]\' . ps-mode) (\.\(?:PDF\|EPUB\|CBZ\|FB2\|O?XPS\|DVI\|OD[FGPST]\|DOCX\|XLSX?\|PPTX?\|pdf\|epub\|cbz\|fb2\|o?xps\|djvu\|dvi\|od[fgpst]\|docx\|xlsx?\|pptx?\)\' . doc-view-mode-maybe) (configure\.\(ac\|in\)\' . autoconf-mode) (\.s\(v\|iv\|ieve\)\' . sieve-mode) (BROWSE\' . ebrowse-tree-mode) (\.ebrowse\' . ebrowse-tree-mode) (#\*mail\* . mail-mode) (\.g\' . antlr-mode) (\.mod\' . m2-mode) (\.ses\' . ses-mode) (\.docbook\' . sgml-mode) (\.com\' . dcl-mode) (/config\.\(?:bat\|log\)\' . fundamental-mode) (/\.?\(authinfo\|netrc\)\' . authinfo-mode) (\.\(?:[iI][nN][iI]\|[lL][sS][tT]\|[rR][eE][gG]\|[sS][yY][sS]\)\' . conf-mode) (\.la\' . conf-unix-mode) (\.ppd\' . conf-ppd-mode) (java.+\.conf\' . conf-javaprop-mode) (\.properties\(?:\.[a-zA-Z0-9._-]+\)?\' . conf-javaprop-mode) (\.toml\' . conf-toml-mode) (\.desktop\' . conf-desktop-mode) (/\.redshift\.conf\' . conf-windows-mode) (\`/etc/\(?:DIR_COLORS\|ethers\|.?fstab\|.*hosts\|lesskey\|login\.?de\(?:fs\|vperm\)\|magic\|mtab\|pam\.d/.*\|permissions\(?:\.d/.+\)?\|protocols\|rpc\|services\)\' . conf-space-mode) (\`/etc/\(?:acpid?/.+\|aliases\(?:\.d/.+\)?\|default/.+\|group-?\|hosts\..+\|inittab\|ksysguarddrc\|opera6rc\|passwd-?\|shadow-?\|sysconfig/.+\)\' . conf-mode) ([cC]hange[lL]og[-.][-0-9a-z]+\' . change-log-mode) (/\.?\(?:gitconfig\|gnokiirc\|hgrc\|kde.*rc\|mime\.types\|wgetrc\)\' . conf-mode) (/\.mailmap\' . conf-unix-mode) (/\.\(?:asound\|enigma\|fetchmail\|gltron\|gtk\|hxplayer\|mairix\|mbsync\|msmtp\|net\|neverball\|nvidia-settings-\|offlineimap\|qt/.+\|realplayer\|reportbug\|rtorrent\.\|screen\|scummvm\|sversion\|sylpheed/.+\|xmp\)rc\' . conf-mode) (/\.\(?:gdbtkinit\|grip\|mpdconf\|notmuch-config\|orbital/.+txt\|rhosts\|tuxracer/options\)\' . conf-mode) (/\.?X\(?:default\|resource\|re\)s\> . conf-xdefaults-mode) (/X11.+app-defaults/\|\.ad\' . conf-xdefaults-mode) (/X11.+locale/.+/Compose\' . conf-colon-mode) (/X11.+locale/compose\.dir\' . conf-javaprop-mode) (\.~?[0-9]+\.[0-9][-.0-9]*~?\' nil t) (\.\(?:orig\|in\|[bB][aA][kK]\)\' nil t) ([/.]c\(?:on\)?f\(?:i?g\)?\(?:\.[a-zA-Z0-9._-]+\)?\' . conf-mode-maybe) (\.[1-9]\' . nroff-mode) (\.art\' . image-mode) (\.avs\' . image-mode) (\.bmp\' . image-mode) (\.cmyk\' . image-mode) (\.cmyka\' . image-mode) (\.crw\' . image-mode) (\.dcr\' . image-mode) (\.dcx\' . image-mode) (\.dng\' . image-mode) (\.dpx\' . image-mode) (\.fax\' . image-mode) (\.heic\' . image-mode) (\.hrz\' . image-mode) (\.icb\' . image-mode) (\.icc\' . image-mode) (\.icm\' . image-mode) (\.ico\' . image-mode) (\.icon\' . image-mode) (\.jbg\' . image-mode) (\.jbig\' . image-mode) (\.jng\' . image-mode) (\.jnx\' . image-mode) (\.miff\' . image-mode) (\.mng\' . image-mode) (\.mvg\' . image-mode) (\.otb\' . image-mode) (\.p7\' . image-mode) (\.pcx\' . image-mode) (\.pdb\' . image-mode) (\.pfa\' . image-mode) (\.pfb\' . image-mode) (\.picon\' . image-mode) (\.pict\' . image-mode) (\.rgb\' . image-mode) (\.rgba\' . image-mode) (\.tga\' . image-mode) (\.wbmp\' . image-mode) (\.webp\' . image-mode) (\.wmf\' . image-mode) (\.wpg\' . image-mode) (\.xcf\' . image-mode) (\.xmp\' . image-mode) (\.xwd\' . image-mode) (\.yuv\' . image-mode) (\.tgz\' . tar-mode) (\.tbz2?\' . tar-mode) (\.txz\' . tar-mode) (\.tzst\' . tar-mode))
